Revit 2027 API
PartUtils.ArePartsValidForDivide Method
 Identifies if provided members are valid for dividing parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool ArePartsValidForDivide(
	Document document,
	ICollection<ElementId> elementIdsToDivide
)
Public Shared Function ArePartsValidForDivide (
	document As Document,
	elementIdsToDivide As ICollection(Of ElementId)
) As Boolean
public:
static bool ArePartsValidForDivide(
	Document^ document,
	ICollection<ElementId^>^ elementIdsToDivide
)
static member ArePartsValidForDivide :
        document : Document *
        elementIdsToDivide : ICollection<ElementId> -> bool
Parameters
document Document
 The document.
elementIdsToDivide ICollection<ElementId>
 Element ids to be tested for validity for dividing parts.
Return Value
Boolean
 True if all member ids are valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace